Revit 2026 API

# FloorFailures Properties

---

The BuiltInFailuresFloorFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FloorSlopeExceedsThreshold | Thickness of this Floor may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in sections and details may not accurately indicate the Thickness shown in Type Properties. |

#### Reference

BuiltInFailuresFloorFailures Class

Autodesk.Revit.DB Namespace